# SystemId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkIterator..::..SystemId Property
MEPNetworkIterator Class See Also
---
The optional MEP system element id where the iterations are restricted.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ElementId SystemId { get; set; }
```

Visual Basic
---
```text
Public Property SystemId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ SystemId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace